'''
Выведите число «пи» (π) с точностью до 5 знаков.
'''

import math


num1 = math.pi
print(round(num1, 5))

