'''
Вывести случайное число в диапазоне от 1 до 100 включительно.
'''

import random

num = random.randint(1, 100)
print(num)

